{
    "wisdom": [
        {
            "description": "Predawn and dusk are usually the best times to fish the Yakima River due to the trout's tendency to feed more during these periods. Mid-day hatch activity can also stimulate surface feeding.",
            "type": "fishing_conditions_best_times"
        },
        {
            "description": "Overcast weather can extend feeding periods, initiating hatches and stimulating surface activity. During a hot sunny day trout may seek deeper water or areas of shade to stay cool, adjust your techniques accordingly.",
            "type": "fishing_conditions_weather_impact"
        },
        {
            "description": "Water levels have significant impact fishing in Yakima. Ideal water discharge for wading is around 999 ft3/s. Higher levels might limit your access to certain spots but could offer potential for streamer fishing.",
            "type": "fishing_conditions_water_discharge"
        },
        {
            "description": "Water and air temperatures greatly affect trout behavior. In 80-degree weather, trout are likely to be most active during cooler moments or in shaded areas. High temps may push trout into cooler, deeper water.",
            "type": "fishing_conditions_temperature"
        },
        {
            "description": "For Blue Winged Olives, which are prevalent in September, try nymph, emerger, dun, and spinner patterns. Adapt your fly choice to each stage of this hatch for optimum success.",
            "type": "fly_setups_setup_1"
        },
        {
            "description": "For Yellow Sally stoneflies, size 14-16 nymphs can be productive during the day, switching over to dry flies in the afternoon can trigger strikes.",
            "type": "fly_setups_setup_2"
        },
        {
            "description": "Caddis often hatch vigorously in the evening stimulating surface feeding frenzies. Use larva and emerger patterns before the hatch, switching to adult Caddis patterns, like the elk hair caddis, as the sun begins to set.",
            "type": "fly_setups_setup_3"
        },
        {
            "description": "Terrestrial patterns like ants, beetles, and hoppers can be effective throughout the day when drifted close to the bank. In particular, hopper-dropper rigs can be successful during breezy days.",
            "type": "fly_setups_setup_4"
        },
        {
            "description": "The upper section of Yakima descends the Cascade Mountains creating cooler, fast water, ideal for smaller cutthroat trout and rainbow trout. Pocket water and rifles here can hide actively feeding fish.",
            "type": "river_sections_upper"
        },
        {
            "description": "The middle section boasts diverse water including deeper holes and faster riffles which can sustain larger rainbow trout. Key in on feeding lanes and seams where fish will hold to conserve energy.",
            "type": "river_sections_middle"
        },
        {
            "description": "The lower Yakima, particularly near the Union Gap to Horn Rapids stretch, offers deep pools and slower runs, making it ideal for dry fly and nymph fishing in late afternoon when the water is more shaded.",
            "type": "river_sections_lower"
        },
        {
            "description": "When a fish takes your dry fly, a timely yet gentle 'trout set' is best - a swift upward lift of the rod. Do note, when nymphing, a 'strip set' is usually more effective. Too vigorous a set could rip the fly out of the fish's mouth.",
            "type": "fishing_techniques_casting"
        },
        {
            "description": "Your approach can make or break your fishing experience. Stealth is paramount. Heavy footfalls on the bank can send shockwaves through the water and scare trout. Stay low, move slowly, and maintain a quiet presence.",
            "type": "fishing_techniques_approach"
        },
        {
            "description": "Fishing the right water is key. Trout often hold in 'buckets' or depressions in the river bottom - these provide rest from current and often cooler water. Deep pools, seam lines, foam lines, and eddies are also worth your attention.",
            "type": "fishing_techniques_reading_water"
        },
        {
            "description": "Perfecting your drift is part of the mastery of fly fishing. Your fly should move with the current, as natural insects would. Adjust your casting angle, and manage your line and mends to achieve the best drifts.",
            "type": "fishing_techniques_drift"
        },
        {
            "description": "The Yakima River, formed from the snowmelt of the eastern Cascade range, has an abundance of holding spots for trout. Faster runs, deeper pools, boulder strewn pockets, riffles and slack waters all provide potential habitat.",
            "type": "geology_river_formation"
        },
        {
            "description": "Undercut banks, overhanging vegetation, and logjams offer shade and cover. Trout often leverage these structures for protection and rest. Instream rocks and gravel bars can create micro-eddies and seams which trout use to feed while expending minimal energy.",
            "type": "geology_river_structure"
        }
    ]
}